gcov-gprof-stats/memcached/vanilla/bench/epoch1/gcov/ben.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   0 secs]  0 threads:      100000 ops,       0 (avg:  112722) ops/sec, 0.00KB/sec (avg: 4.58MB/sec),  0.00 (avg:  1.77) msec latency

4         Threads
50        Connections per thread
500       Requests per client


ALL STATS
=========================================================================
Type         Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
-------------------------------------------------------------------------
Sets         9692.02          ---          ---      2.01400       745.25 
Gets        95655.98         0.00     95655.98      1.74600      3634.92 
Waits           0.00          ---          ---      0.00000          --- 
Totals     105347.99         0.00     95655.98      1.77100      4380.17 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.160         0.02
SET       0.260         0.03
SET       0.270         0.04
SET       0.280         0.05
SET       0.300         0.09
SET       0.330         0.14
SET       0.340         0.16
SET       0.350         0.17
SET       0.360         0.18
SET       0.370         0.20
SET       0.390         0.21
SET       0.400         0.23
SET       0.420         0.27
SET       0.430         0.33
SET       0.440         0.41
SET       0.450         0.45
SET       0.460         0.46
SET       0.470         0.47
SET       0.480         0.48
SET       0.510         0.50
SET       0.520         0.53
SET       0.530         0.58
SET       0.540         0.65
SET       0.550         0.83
SET       0.560         0.93
SET       0.570         1.09
SET       0.580         1.18
SET       0.590         1.26
SET       0.600         1.32
SET       0.610         1.37
SET       0.620         1.42
SET       0.630         1.49
SET       0.640         1.53
SET       0.650         1.55
SET       0.660         1.57
SET       0.690         1.58
SET       0.700         1.59
SET       0.710         1.60
SET       0.720         1.64
SET       0.730         1.75
SET       0.740         1.78
SET       0.770         1.83
SET       0.830         1.84
SET       0.840         1.87
SET       0.850         1.88
SET       0.860         1.90
SET       0.870         1.92
SET       0.880         1.96
SET       0.890         1.98
SET       0.900         2.01
SET       0.910         2.03
SET       0.920         2.11
SET       0.930         2.17
SET       0.940         2.25
SET       0.950         2.30
SET       0.960         2.43
SET       0.970         2.64
SET       0.980         2.93
SET       0.990         3.34
SET       1.000         4.61
SET       1.100         6.50
SET       1.200         7.21
SET       1.300         8.68
SET       1.400        13.25
SET       1.500        30.50
SET       1.600        53.89
SET       1.700        65.76
SET       1.800        69.29
SET       1.900        70.87
SET       2.000        73.24
SET       2.100        78.98
SET       2.200        86.01
SET       2.300        91.70
SET       2.400        94.50
SET       2.500        96.01
SET       2.600        96.68
SET       2.700        96.82
SET       2.800        96.90
SET       2.900        96.98
SET       3.000        97.10
SET       3.100        97.12
SET       3.200        97.15
SET       3.300        97.18
SET       3.400        97.23
SET       3.500        97.30
SET       3.600        97.34
SET       3.700        97.39
SET       3.800        97.40
SET       4.000        97.48
SET       4.100        97.59
SET       4.400        97.62
SET       4.500        97.64
SET       4.600        97.65
SET       5.000        97.66
SET       5.400        97.75
SET       5.500        97.80
SET       5.800        97.82
SET       6.000        97.85
SET       6.200        97.86
SET       6.700        97.87
SET      13.000        98.03
SET      14.000        98.76
SET      15.000        99.53
SET      16.000        99.84
SET      17.000       100.00
---
GET       0.140         0.00
GET       0.160         0.00
GET       0.170         0.00
GET       0.180         0.01
GET       0.190         0.02
GET       0.200         0.02
GET       0.210         0.03
GET       0.220         0.03
GET       0.230         0.03
GET       0.240         0.04
GET       0.250         0.05
GET       0.260         0.06
GET       0.270         0.06
GET       0.280         0.07
GET       0.290         0.07
GET       0.300         0.09
GET       0.310         0.10
GET       0.320         0.11
GET       0.330         0.13
GET       0.340         0.14
GET       0.350         0.15
GET       0.360         0.16
GET       0.370         0.17
GET       0.380         0.18
GET       0.390         0.20
GET       0.400         0.21
GET       0.410         0.24
GET       0.420         0.29
GET       0.430         0.33
GET       0.440         0.35
GET       0.450         0.36
GET       0.460         0.38
GET       0.470         0.41
GET       0.480         0.44
GET       0.490         0.47
GET       0.500         0.50
GET       0.510         0.54
GET       0.520         0.61
GET       0.530         0.69
GET       0.540         0.79
GET       0.550         0.87
GET       0.560         0.95
GET       0.570         1.01
GET       0.580         1.08
GET       0.590         1.15
GET       0.600         1.21
GET       0.610         1.25
GET       0.620         1.28
GET       0.630         1.31
GET       0.640         1.35
GET       0.650         1.38
GET       0.660         1.41
GET       0.670         1.43
GET       0.680         1.46
GET       0.690         1.49
GET       0.700         1.53
GET       0.710         1.56
GET       0.720         1.59
GET       0.730         1.60
GET       0.740         1.61
GET       0.750         1.64
GET       0.760         1.66
GET       0.770         1.68
GET       0.780         1.70
GET       0.790         1.72
GET       0.800         1.75
GET       0.810         1.78
GET       0.820         1.83
GET       0.830         1.91
GET       0.840         1.98
GET       0.850         2.06
GET       0.860         2.13
GET       0.870         2.20
GET       0.880         2.27
GET       0.890         2.33
GET       0.900         2.37
GET       0.910         2.42
GET       0.920         2.46
GET       0.930         2.50
GET       0.940         2.54
GET       0.950         2.59
GET       0.960         2.71
GET       0.970         2.97
GET       0.980         3.35
GET       0.990         3.77
GET       1.000         5.12
GET       1.100         6.60
GET       1.200         7.19
GET       1.300         8.90
GET       1.400        14.94
GET       1.500        36.53
GET       1.600        59.63
GET       1.700        68.29
GET       1.800        70.92
GET       1.900        72.04
GET       2.000        74.48
GET       2.100        81.15
GET       2.200        89.66
GET       2.300        94.82
GET       2.400        96.97
GET       2.500        97.88
GET       2.600        98.30
GET       2.700        98.42
GET       2.800        98.52
GET       2.900        98.57
GET       3.000        98.62
GET       3.100        98.64
GET       3.200        98.67
GET       3.300        98.71
GET       3.400        98.73
GET       3.500        98.78
GET       3.600        98.82
GET       3.700        98.85
GET       3.800        98.89
GET       3.900        98.92
GET       4.000        98.95
GET       4.100        98.99
GET       4.200        99.03
GET       4.300        99.05
GET       4.400        99.08
GET       4.500        99.10
GET       4.600        99.14
GET       4.700        99.17
GET       4.800        99.21
GET       4.900        99.25
GET       5.000        99.32
GET       5.100        99.34
GET       5.200        99.36
GET       5.300        99.38
GET       5.400        99.41
GET       5.500        99.43
GET       5.600        99.48
GET       5.700        99.50
GET       5.800        99.52
GET       5.900        99.55
GET       6.000        99.59
GET       6.100        99.60
GET       6.200        99.62
GET       6.300        99.64
GET       6.400        99.66
GET       6.500        99.67
GET       6.600        99.71
GET       6.700        99.74
GET       6.800        99.75
GET       6.900        99.77
GET       7.000        99.80
GET       7.100        99.82
GET       7.200        99.83
GET       7.300        99.83
GET       7.400        99.83
GET       7.500        99.84
GET       7.600        99.85
GET       7.700        99.85
GET       7.900        99.85
GET       8.000        99.86
GET       8.100        99.87
GET       8.200        99.87
GET       8.300        99.88
GET       8.400        99.88
GET       8.700        99.88
GET       8.800        99.89
GET       8.900        99.89
GET       9.100        99.90
GET       9.200        99.91
GET       9.300        99.92
GET       9.400        99.92
GET       9.800        99.92
GET       9.900        99.92
GET      10.000        99.94
GET      11.000       100.00
GET      12.000       100.00
GET      13.000       100.00
---